In [14]:
import pandas as pd
import numpy as np

In [21]:
data = np.random.randint(1,100,10)

In [22]:
data

array([24, 45, 98, 45,  1, 86, 65, 72, 10, 93])

In [23]:
ser = pd.Series(data = data)

In [24]:
ser

0    24
1    45
2    98
3    45
4     1
5    86
6    65
7    72
8    10
9    93
dtype: int64

In [25]:
l = [234,4,23,2]

In [27]:
p = pd.Series(data =l,index=['run','time','class','person'])

In [28]:
p

run       234
time        4
class      23
person      2
dtype: int64

In [37]:
# can call any using array
#example
p['time']

4

In [38]:
p[0]

234

In [40]:
rd = np.random.randint(1,100,(4,9))

In [41]:
rd

array([[70, 79, 32, 17, 21, 88, 77, 41, 26],
       [ 9, 65, 85, 82, 97, 67, 54, 76, 88],
       [33, 62, 14, 48, 84, 14, 72, 80, 35],
       [ 9, 66, 96, 79, 30, 54, 32, 79, 72]])

In [44]:
pd.DataFrame(data=rd)#DataFrame a common representation

    0   1   2   3   4   5   6   7   8
0  70  79  32  17  21  88  77  41  26
1   9  65  85  82  97  67  54  76  88
2  33  62  14  48  84  14  72  80  35
3   9  66  96  79  30  54  32  79  72

In [46]:
home = pd.DataFrame(data=rd,columns=['o','q','w','e','r','t','y','u','h'],index=['wish','ki','dfa','win'])

In [47]:
home

       o   q   w   e   r   t   y   u   h
wish  70  79  32  17  21  88  77  41  26
ki     9  65  85  82  97  67  54  76  88
dfa   33  62  14  48  84  14  72  80  35
win    9  66  96  79  30  54  32  79  72

In [50]:
home.columns#calling column n columns

Index(['o', 'q', 'w', 'e', 'r', 't', 'y', 'u', 'h'], dtype='object')

In [51]:
home.index#calling column n index

Index(['wish', 'ki', 'dfa', 'win'], dtype='object')

In [53]:
home.head(3)#can call index from top as u wish

       o   q   w   e   r   t   y   u   h
wish  70  79  32  17  21  88  77  41  26
ki     9  65  85  82  97  67  54  76  88
dfa   33  62  14  48  84  14  72  80  35

In [55]:
home.tail(2)# can call index from bottom

      o   q   w   e   r   t   y   u   h
dfa  33  62  14  48  84  14  72  80  35
win   9  66  96  79  30  54  32  79  72

In [56]:
home.info

<bound method DataFrame.info of        o   q   w   e   r   t   y   u   h
wish  70  79  32  17  21  88  77  41  26
ki     9  65  85  82  97  67  54  76  88
dfa   33  62  14  48  84  14  72  80  35
win    9  66  96  79  30  54  32  79  72>

In [59]:
home.mean()

o    30.25
q    68.00
w    56.75
e    56.50
r    58.00
t    55.75
y    58.75
u    69.00
h    55.25
dtype: float64

In [60]:
home.min()

o     9
q    62
w    14
e    17
r    21
t    14
y    32
u    41
h    26
dtype: int64

In [61]:
home.std()

o    28.814059
q     7.527727
w    39.911360
e    30.490436
r    38.078866
t    31.159536
y    20.385861
u    18.743888
h    29.545163
dtype: float64

In [62]:
home.max()

o    70
q    79
w    96
e    82
r    97
t    88
y    77
u    80
h    88
dtype: int64

In [63]:
home['o']

wish    70
ki       9
dfa     33
win      9
Name: o, dtype: int64

In [64]:
#can do arithmetic 
home['o']*home['t']

wish    6160
ki       603
dfa      462
win      486
dtype: int64

In [67]:
# can change value
home['h']= [4,5,6,7]

In [68]:
home #as value as changed

       o   q   w   e   r   t   y   u  h
wish  70  79  32  17  21  88  77  41  4
ki     9  65  85  82  97  67  54  76  5
dfa   33  62  14  48  84  14  72  80  6
win    9  66  96  79  30  54  32  79  7

In [78]:
#dropping 
home=home.drop('y',axis = 1)

In [79]:
home# y is gone

       o   q   w   e   r   t   u
wish  70  79  32  17  21  88  41
ki     9  65  85  82  97  67  76
dfa   33  62  14  48  84  14  80
win    9  66  96  79  30  54  79

In [81]:
# calling the specific columns
home[home.index=='ki']

    o   q   w   e   r   t   u
ki  9  65  85  82  97  67  76

In [83]:
# very commonly use 
home.describe()

,o,q,w,e,r,t,u
count,4.000000,4.000000,4.00000,4.000000,4.000000,4.000000,4.000000
mean,30.250000,68.000000,56.75000,56.500000,58.000000,55.750000,69.000000
std,28.814059,7.527727,39.91136,30.490436,38.078866,31.159536,18.743888
min,9.000000,62.000000,14.00000,17.000000,21.000000,14.000000,41.000000
25%,9.000000,64.250000,27.50000,40.250000,27.750000,44.000000,67.250000
50%,21.000000,65.500000,58.50000,63.500000,57.000000,60.500000,77.500000
75%,42.250000,69.250000,87.75000,79.750000,87.250000,72.250000,79.250000
max,70.000000,79.000000,96.00000,82.000000,97.000000,88.000000,80.000000

In [98]:
home

       o   q   w   e   r   t   u
wish  70  79  32  17  21  88  41
ki     9  65  85  82  97  67  76
dfa   33  62  14  48  84  14  80
win    9  66  96  79  30  54  79

In [103]:
k =pd.DataFrame(np.random.randint(1,100,(4,7)),columns=['o','q','w','e','r','t','u'],index=['wish','ki','dfa','win'])
k
#can concat,merge,appende etc

       o   q   w   e   r   t   u
wish  19  89  64  38  59  57  39
ki    70   5  27  81  46  42  40
dfa   10  61  83  24  90  24  76
win   81  84  26   7  50  17  54

In [104]:
pd.merge(k,home,left_index=True,right_index=True)

      o_x  q_x  w_x  e_x  r_x  t_x  u_x  o_y  q_y  w_y  e_y  r_y  t_y  u_y
wish   19   89   64   38   59   57   39   70   79   32   17   21   88   41
ki     70    5   27   81   46   42   40    9   65   85   82   97   67   76
dfa    10   61   83   24   90   24   76   33   62   14   48   84   14   80
win    81   84   26    7   50   17   54    9   66   96   79   30   54   79

In [105]:
pd.concat([k,home])

       o   q   w   e   r   t   u
wish  19  89  64  38  59  57  39
ki    70   5  27  81  46  42  40
dfa   10  61  83  24  90  24  76
win   81  84  26   7  50  17  54
wish  70  79  32  17  21  88  41
ki     9  65  85  82  97  67  76
dfa   33  62  14  48  84  14  80
win    9  66  96  79  30  54  79

In [112]:
o = pd.DataFrame(np.random.randint(1,100,(1,2)),columns=['A','B'])
o

   A   B
0  2  75

In [110]:
o= o.append({'A':40,'B':50},ignore_index=True)

In [111]:
o # as new row is append

    A   B
0  60  82
1  40  50